Tekla Open API Reference for Tekla Structures 2025
BoltItemEnumerator Properties
The BoltItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a bolt item instance of the current element.
Top
See Also
Reference
BoltItemEnumerator Class
Tekla.Structures.Catalogs Namespace